TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиЗапретаВскрытияПоНоменклатуре/гкс_НастройкиЗапретаВскрытияПоНоменклатуре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиЗапретаВскрытияПоНоменклатуре</name>
  <resources>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопускКВскрытию</name>
    <type>
      <types>EnumRef.гкс_ДопускиКВскрытиюВагонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЖДСтанция</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиЗапретаВскрытияПоНоменклатуре/Forms/ФормаЗаписи/Module.bsl
// Модуль формы записи регистра сведений гкс_НастройкиЗапретаВскрытияПоНоменклатуре.
// Заполнение дефолтов из параметров открытия и фиксация автора при записи.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЭтоНоваяЗапись() Тогда
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		Запись.Активен = Истина;
		Если Не ЗначениеЗаполнено(Запись.ДатаНачала) Тогда
			Запись.ДатаНачала = НачалоДня(ТекущаяДатаСеанса);
		КонецЕсли;
		Если Параметры.Свойство("ВидПеревозки") И ЗначениеЗаполнено(Параметры.ВидПеревозки) Тогда
			Запись.ВидПеревозки = Параметры.ВидПеревозки;
		КонецЕсли;
		Запись.Пользователь = Пользователи.ТекущийПользователь();
		Запись.ДатаВремяИзменения = ТекущаяДатаСеанса;
	КонецЕсли;

	Элементы.Пользователь.ТолькоПросмотр = Истина;
	Элементы.ДатаВремяИзменения.ТолькоПросмотр = Истина;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПериодНекорректен() Тогда
		ТекстСообщения = НСтр("ru = 'Дата окончания не может быть меньше даты начала'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	Если Не Отказ Тогда
		ТекущийОбъект.Пользователь = Пользователи.ТекущийПользователь();
		ТекущийОбъект.ДатаВремяИзменения = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтоНоваяЗапись()
	Возврат Не ЗначениеЗаполнено(Запись.Номенклатура) И Не ЗначениеЗаполнено(Запись.ДопускКВскрытию);
КонецФункции

// Возвращает Истина, если у записи дата окончания указана и меньше даты начала.
// 
// Возвращаемое значение:
//  Булево - Период некорректен
&НаСервере
Функция ПериодНекорректен()
	ПустаяДата = Дата(1, 1, 1);
	Возврат Запись.ДатаОкончания <> ПустаяДата
		И Запись.ДатаОкончания < Запись.ДатаНачала;
КонецФункции

#КонецОбласти
